from handlers.handler import Handler
from settings import configuration
from services import api_request, validators, errors_handlers, pdf_creator
from settings.messages import car_report_message_spcr, fines_message, fssp_message
from pprint import pprint


fake_data = {'data': [{'active_from': '1900-01-01T00:00:00.000Z',
           'active_to': '3000-01-01T00:00:00.000Z',
           'comment': '',
           'content': {'accidents': {'has_accidents': False,
                                     'history': {'count': 0, 'items': []}},
                       'additional_info': {'vehicle': {'category': {'code': 'B'},
                                                       'exported': False,
                                                       'modifications': {'was_modificated': False},
                                                       'passport': {'date': {'receive': '2014-05-16 '
                                                                                        '00:00:00'},
                                                                    'has_dublicate': False,
                                                                    'number': '77УО070949'},
                                                       'sts': {'date': {'receive': '2022-04-29 '
                                                                                   '00:00:00'}}}},
                       'ads': {'history': {'count': 0, 'items': []}},
                       'commercial_use': {'items': []},
                       'fines': {'count': 6,
                                 'has_fines': True,
                                 'items': [{'_id': 142960845,
                                            'amount': {'total': 3000},
                                            'date': {'event': '2022-06-24 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '0321695310122062400016034 '
                                                           'от 2022-06-24 на '
                                                           '3,000.00 руб.',
                                            'discount': {'date': {'end': '2022-07-14 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'Г. СПБ, ПР. '
                                                                'ЛИГОВСКИЙ, У '
                                                                'Д.16А, ОТ '
                                                                'КУЗНЕЧНОГО '
                                                                'ПЕР. К ПЛ. '
                                                                'ВОССТАНИЯ, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '0321695310122062400016034',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(Комитет по '
                                                               'транспорту)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'Северо-Западное '
                                                                      'ГУ '
                                                                      'Банка '
                                                                      'России '
                                                                      '//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '82811601122010000140',
                                                     'okato': '40911000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '0321695310122062400016034 '
                                                                            'от '
                                                                            '24.06.2022'},
                                                     'user': {'kpp': '784201001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(Комитет '
                                                                      'по '
                                                                      'транспорту)',
                                                              'tin': '7830001067'}}},
                                           {'_id': 301624611,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-06-16 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810510220616074211 '
                                                           'от 2022-06-16 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-07-06 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': '289 КМ., 960 '
                                                                'М., '
                                                                'АВТОДОРОГА '
                                                                'А-121 '
                                                                "'СОРТАВАЛА', "
                                                                'КАРЕЛИЯ '
                                                                'РЕСП.'},
                                            'need_payment': False,
                                            'uin': '18810510220616074211',
                                            'vendor': {'name': 'УФК ПО '
                                                               'РЕСПУБЛИКЕ '
                                                               'КАРЕЛИЯ (МВД '
                                                               'по Республике '
                                                               'Карелия)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000010600'},
                                                              'bik': '018602104',
                                                              'name': 'ОТДЕЛЕНИЕ-НБ '
                                                                      'РЕСПУБЛИКА '
                                                                      'КАРЕЛИЯ '
                                                                      'БАНКА '
                                                                      'РОССИИ'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '86701000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810510220616074211 '
                                                                            'от '
                                                                            '16.06.2022'},
                                                     'user': {'kpp': '100101001',
                                                              'name': 'УФК ПО '
                                                                      'РЕСПУБЛИКЕ '
                                                                      'КАРЕЛИЯ '
                                                                      '(МВД по '
                                                                      'Республике '
                                                                      'Карелия)',
                                                              'tin': '1001041280'}}},
                                           {'_id': 2840402855,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-06-03 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810578220603273039 '
                                                           'от 2022-06-03 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-06-23 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'СЛАВЫ ПРОСП., '
                                                                'д.43/49, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '18810578220603273039',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(УГИБДД ГУ МВД '
                                                               'России по г. '
                                                               'Санкт-Петербургу '
                                                               'и '
                                                               'Ленинградской '
                                                               'области)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'СЕВЕРО-ЗАПАДНОЕ '
                                                                      'ГУ '
                                                                      'БАНКА '
                                                                      'РОССИИ//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '40394000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810578220603273039 '
                                                                            'от '
                                                                            '03.06.2022'},
                                                     'user': {'kpp': '781345001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(УГИБДД '
                                                                      'ГУ МВД '
                                                                      'России '
                                                                      'по г. '
                                                                      'Санкт-Петербургу '
                                                                      'и '
                                                                      'Ленинградской '
                                                                      'области)',
                                                              'tin': '7830002600'}}},
                                           {'_id': 1924936835,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-06-03 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810578220603152861 '
                                                           'от 2022-06-03 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-06-23 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'ЛЕНИНСКИЙ '
                                                                'ПРОСП., '
                                                                'д.147-А, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '18810578220603152861',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(УГИБДД ГУ МВД '
                                                               'России по г. '
                                                               'Санкт-Петербургу '
                                                               'и '
                                                               'Ленинградской '
                                                               'области)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'СЕВЕРО-ЗАПАДНОЕ '
                                                                      'ГУ '
                                                                      'БАНКА '
                                                                      'РОССИИ//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '40394000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810578220603152861 '
                                                                            'от '
                                                                            '03.06.2022'},
                                                     'user': {'kpp': '781345001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(УГИБДД '
                                                                      'ГУ МВД '
                                                                      'России '
                                                                      'по г. '
                                                                      'Санкт-Петербургу '
                                                                      'и '
                                                                      'Ленинградской '
                                                                      'области)',
                                                              'tin': '7830002600'}}},
                                           {'_id': 2868016983,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-06-02 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810578220602401300 '
                                                           'от 2022-06-02 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-06-22 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'СЛАВЫ ПРОСП., '
                                                                'д.43/49, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '18810578220602401300',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(УГИБДД ГУ МВД '
                                                               'России по г. '
                                                               'Санкт-Петербургу '
                                                               'и '
                                                               'Ленинградской '
                                                               'области)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'СЕВЕРО-ЗАПАДНОЕ '
                                                                      'ГУ '
                                                                      'БАНКА '
                                                                      'РОССИИ//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '40394000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810578220602401300 '
                                                                            'от '
                                                                            '02.06.2022'},
                                                     'user': {'kpp': '781345001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(УГИБДД '
                                                                      'ГУ МВД '
                                                                      'России '
                                                                      'по г. '
                                                                      'Санкт-Петербургу '
                                                                      'и '
                                                                      'Ленинградской '
                                                                      'области)',
                                                              'tin': '7830002600'}}},
                                           {'_id': 825679884,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-05-30 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810578220530428054 '
                                                           'от 2022-05-30 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-06-19 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'СЛАВЫ ПРОСП., '
                                                                'д.43/49, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '18810578220530428054',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(УГИБДД ГУ МВД '
                                                               'России по г. '
                                                               'Санкт-Петербургу '
                                                               'и '
                                                               'Ленинградской '
                                                               'области)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'СЕВЕРО-ЗАПАДНОЕ '
                                                                      'ГУ '
                                                                      'БАНКА '
                                                                      'РОССИИ//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '40394000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810578220530428054 '
                                                                            'от '
                                                                            '30.05.2022'},
                                                     'user': {'kpp': '781345001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(УГИБДД '
                                                                      'ГУ МВД '
                                                                      'России '
                                                                      'по г. '
                                                                      'Санкт-Петербургу '
                                                                      'и '
                                                                      'Ленинградской '
                                                                      'области)',
                                                              'tin': '7830002600'}}}]},
                       'identifiers': {'vehicle': {'pts': '77УО070949',
                                                   'reg_num': 'О956КВ716',
                                                   'sts': '9942879293',
                                                   'vin': 'WDD1760521J279894'}},
                       'identifiers_masked': {'vehicle': {'pts': '77У*****49',
                                                          'reg_num': 'О9*****16',
                                                          'sts': '994*****93',
                                                          'vin': 'WDD1************4'}},
                       'images': {'photos': {'count': 5,
                                             'items': [{'_id': 2251974969,
                                                        'date': {'issued': '2022-08-26 '
                                                                           '00:00:00'},
                                                        'uri': 'https://ng-images.avtocod.ru/images/2022/09/18/38cfb48cdbc9b802a0a7a67515becd7c.jpg'},
                                                       {'_id': 746517553,
                                                        'date': {'issued': '2022-08-25 '
                                                                           '21:51:08'},
                                                        'uri': 'https://img03.platesmania.com/220825/o/19795067.jpg',
                                                        'vehicle': {'brand': {'name': 'Mercedes-Benz'},
                                                                    'model': {'name': 'A-Klasse'}}},
                                                       {'_id': 1577076771,
                                                        'date': {'issued': '2022-06-23 '
                                                                           '00:00:00'},
                                                        'uri': 'https://ng-images.avtocod.ru/images/2022/09/18/8872cb86ddba51872352fa33e625231d.jpg'},
                                                       {'_id': 3114868144,
                                                        'date': {'issued': '2022-06-23 '
                                                                           '00:00:00'},
                                                        'uri': 'https://ng-images.avtocod.ru/images/2022/09/18/c05696b0ade0d50a02e7f885b484743d.jpg'},
                                                       {'_id': 3485710330,
                                                        'date': {'issued': '2022-06-23 '
                                                                           '00:00:00'},
                                                        'uri': 'https://ng-images.avtocod.ru/images/2022/09/18/77e7b3a3b5f0a7701ed2a20d441c99ba.jpg'}]}},
                       'insurance': {'osago': {'count': 1,
                                               'items': [{'_id': 131371244,
                                                          'contract': {'amount': {'currency': 'RUB',
                                                                                  'value': 13255.85},
                                                                       'has_trailer': False,
                                                                       'is_active': True,
                                                                       'is_follow_to_registration': False,
                                                                       'kbm': 0.83,
                                                                       'using_type': {'description': 'Личная',
                                                                                      'status': 'PERSONAL'}},
                                                          'date': {'created': '2022-04-28 '
                                                                              '00:00:00',
                                                                   'end': '2023-04-28 '
                                                                          '00:00:00',
                                                                   'periods': [{'end': '2023-04-28',
                                                                                'start': '2022-04-29'}],
                                                                   'start': '2022-04-29 '
                                                                            '00:00:00'},
                                                          'geo': {'region': 'Татарстан '
                                                                            'Респ'},
                                                          'insurant': {'dob': '1993-07-01',
                                                                       'name': 'Х***** '
                                                                               'ШАМИЛЬ '
                                                                               'НИЯЗОВИЧ',
                                                                       'type': 'PERSON'},
                                                          'insurer': {'name': 'АО '
                                                                              '"ГСК '
                                                                              '"Югория"'},
                                                          'number': 'ХХХ '
                                                                    '0237468752',
                                                          'owner': {'dob': '1993-07-01',
                                                                    'name': 'Х***** '
                                                                            'ШАМИЛЬ '
                                                                            'НИЯЗОВИЧ',
                                                                    'type': 'PERSON'},
                                                          'policy': {'expired': False,
                                                                     'is_active': True,
                                                                     'number': '0237468752',
                                                                     'series': 'ХХХ',
                                                                     'status': 'Действует'},
                                                          'restrictions': {'drivers': 1,
                                                                           'type': 'WITH '
                                                                                   'RESTRICTIONS'},
                                                          'vehicle': {'engine': {'power': {'hp': 360}},
                                                                      'identifiers': {'vin': 'WDD1760521J279894'},
                                                                      'model': {'name': 'MERCEDES-BENZ '
                                                                                        'A45 '
                                                                                        'AMG, '
                                                                                        'MERCEDES-BENZ '
                                                                                        'A45 '
                                                                                        'AMG '
                                                                                        '(категория '
                                                                                        '«B»)'}}}]}},
                       'leasings': {'count': 0,
                                    'items': [],
                                    'used_in_leasing': False},
                       'mileages': {'count': 5,
                                    'items': [{'_id': 1354850421,
                                               'actuality': {'date': '2022-09-13 '
                                                                     '19:04:35'},
                                               'date': {'event': '2016-11-10 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'repairs.history'},
                                               'mileage': 26571},
                                              {'_id': 1919635491,
                                               'actuality': {'date': '2022-09-15 '
                                                                     '17:56:09'},
                                               'date': {'event': '2017-06-15 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'gibdd.eaisto'},
                                               'mileage': 34100},
                                              {'_id': 2886830751,
                                               'actuality': {'date': '2022-09-15 '
                                                                     '17:56:09'},
                                               'date': {'event': '2019-06-17 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'gibdd.eaisto'},
                                               'mileage': 44950},
                                              {'_id': 927710437,
                                               'actuality': {'date': '2022-09-18 '
                                                                     '12:04:22'},
                                               'date': {'event': '2021-07-21 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'service.history'},
                                               'mileage': 91846},
                                              {'_id': 4285171619,
                                               'actuality': {'date': '2022-09-15 '
                                                                     '17:56:09'},
                                               'date': {'event': '2022-04-29 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'gibdd.eaisto'},
                                               'mileage': 96106}]},
                       'ownership': {'history': {'count': 2,
                                                 'items': [{'_id': 2204300142,
                                                            'date': {'start': '2022-04-29 '
                                                                              '00:00:00'},
                                                            'last_operation': {'code': '03',
                                                                               'description': 'Изменение '
                                                                                              'собственника '
                                                                                              '(владельца) '
                                                                                              'в '
                                                                                              'результате '
                                                                                              'совершения '
                                                                                              'сделки, '
                                                                                              'вступления '
                                                                                              'в '
                                                                                              'наследство, '
                                                                                              'слияние '
                                                                                              'и '
                                                                                              'разделение '
                                                                                              'капитала '
                                                                                              'у '
                                                                                              'юридического '
                                                                                              'лица, '
                                                                                              'переход '
                                                                                              'права '
                                                                                              'по '
                                                                                              'договору '
                                                                                              'лизинга, '
                                                                                              'судебные '
                                                                                              'решения '
                                                                                              'и '
                                                                                              'др.'},
                                                            'owner': {'type': 'PERSON'}},
                                                           {'_id': 514048436,
                                                            'date': {'end': '2022-04-29 '
                                                                            '00:00:00',
                                                                     'start': '2014-06-20 '
                                                                              '00:00:00'},
                                                            'last_operation': {'code': '01',
                                                                               'description': 'Регистрация '
                                                                                              'новых, '
                                                                                              'произведенных '
                                                                                              'в '
                                                                                              'России '
                                                                                              'или '
                                                                                              'везенных, '
                                                                                              'а '
                                                                                              'также '
                                                                                              'ввезенных '
                                                                                              'в '
                                                                                              'Россию '
                                                                                              'бывших '
                                                                                              'в '
                                                                                              'эксплуатации, '
                                                                                              'в '
                                                                                              'том '
                                                                                              'числе '
                                                                                              'временно '
                                                                                              'на '
                                                                                              'срок '
                                                                                              'более '
                                                                                              '6 '
                                                                                              'месяцев, '
                                                                                              'испытательной '
                                                                                              'техники'},
                                                            'owner': {'type': 'PERSON'}}]}},
                       'pledges': {'count': 0,
                                   'date': {'update': '2022-09-18 00:00:00'},
                                   'items': []},
                       'registration_actions': {'count': 2,
                                                'items': [{'_id': 3386762975,
                                                           'code': '94',
                                                           'date': {'start': '2022-04-29 '
                                                                             '00:00:00'},
                                                           'identifiers': {'pts': '77УО070949'},
                                                           'owner': {'type': 'PERSON'},
                                                           'type': 'Изменение '
                                                                   'собственника '
                                                                   'по '
                                                                   'сделкам, '
                                                                   'произведенным '
                                                                   'в любой '
                                                                   'форме с '
                                                                   'сохранением '
                                                                   'государственных '
                                                                   'регистрационных '
                                                                   'знаков'},
                                                          {'_id': 2929618715,
                                                           'code': '11',
                                                           'date': {'end': '2022-04-29 '
                                                                           '00:00:00',
                                                                    'start': '2014-06-20 '
                                                                             '00:00:00'},
                                                           'geo': {'city': 'г '
                                                                           'Москва',
                                                                   'house': '20',
                                                                   'region': 'г '
                                                                             'Москва',
                                                                   'street': 'ул '
                                                                             'Лобненская'},
                                                           'identifiers': {'pts': '77УО070949'},
                                                           'owner': {'type': 'PERSON'},
                                                           'type': 'Первичная '
                                                                   'регистрация'}]},
                       'report_meta': {},
                       'restrictions': {'registration_actions': {'count': 0,
                                                                 'has_restrictions': False,
                                                                 'items': []}},
                       'stealings': {'count': 0,
                                     'is_wanted': False,
                                     'items': []},
                       'taxi': {'history': {'count': 0, 'items': []},
                                'used_in_taxi': False},
                       'tech_data': {'body': {'color': {'name': 'Синий Яркий',
                                                        'type': 'Синий'}},
                                     'brand': {'id': 'ID_MARK_MERCEDES_BENZ',
                                               'logotype': {'uri': 'https://vl.imgix.net/img/mercedes-benz-logo.png'},
                                               'name': {'normalized': 'Mercedes-Benz',
                                                        'original': 'Mercedes '
                                                                    'Benz Без '
                                                                    'Модели '
                                                                    'А45 Амg '
                                                                    '4Матiс'}},
                                     'drive': {'type': 'Полноприводной',
                                               'type_id': 'ID_DRIVING_WHEELS_TYPE_ALL'},
                                     'engine': {'fuel': {'type': 'Бензиновый',
                                                         'type_id': 'ID_ENGINE_TYPE_PETROL'},
                                                'model': {'name': '133980'},
                                                'number': '80012778',
                                                'power': {'hp': 360, 'kw': 265},
                                                'volume': 1991},
                                     'model': {'id': 'ID_MARK_MERCEDES_BENZ_MODEL_A_KLASS_AMG',
                                               'name': {'normalized': 'A-Класс '
                                                                      'AMG'}},
                                     'type': {'code': '29',
                                              'name': 'Легковые автомобили '
                                                      'прочие'},
                                     'weight': {'max': 2050, 'netto': 1555},
                                     'wheel': {'position': 'LEFT',
                                               'position_code': '1',
                                               'position_id': 'ID_STEERING_WHEEL_TYPE_LEFT'},
                                     'year': 2014},
                       'utilizations': {'count': 0,
                                        'items': [],
                                        'was_utilized': False}},
           'created_at': '2022-09-18T12:04:21.752Z',
           'created_by': 'system',
           'domain_uid': 'iqworks',
           'last_generation_stat': {'complete_time': '2022-09-18T12:05:23.776Z',
                                    'duration': 61980,
                                    'start_time': '2022-09-18T12:04:21.796Z'},
           'name': 'NONAME',
           'progress_error': 0,
           'progress_ok': 20,
           'progress_wait': 0,
           'query': {'body': 'WDD1760521J279894',
                     'schema_version': '1.0',
                     'storages': {},
                     'type': 'VIN'},
           'report_type_uid': 'report_check_vehicle@iqworks',
           'requested_at': '2022-09-18T12:04:21.796Z',
           'state': {'sources': [{'_id': 'carsharing.registry',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'service.history.fitservice',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'pledge',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.dtp',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.restrict',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.wanted',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'fines.base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'av.taxi',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'service.history.filter',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.history',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'service.history',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'mileages.registry',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'ads.base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'references.base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'service.history.wilgood',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'images.avtonomer',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.eaisto',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'rsaosago.base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'images.archive',
                                  'extended_state': 'OK',
                                  'state': 'OK'}]},
           'tags': '',
           'uid': 'report_check_vehicle_WDD1760521J279894@iqworks',
           'updated_at': '2022-09-18T12:05:24.799Z',
           'updated_by': 'system',
           'vehicle_id': 'WDD1760521J279894'}],
 'size': 1,
 'stamp': '2022-09-18T12:06:06.827Z',
 'state': 'ok',
 'version': '2.0'}




class HandlerText(Handler):

    def __init__(self, bot):
        super().__init__(bot)

    def incorrect_input_for_report(self, message):
        self.bot.send_message(message.chat.id, 'Введите корректный VIN (17 знаков) или номер авто формата Х777ХХ197.'
                                               ' Повторите ввод',
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())

    def incorrect_input_regnumber(self, message):
        self.bot.send_message(message.chat.id, 'Введите корректный номер авто формата Х777ХХ197. Повторите ввод',
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())

    def incorrect_input_stsnumber(self, message):
        self.bot.send_message(message.chat.id, 'Введите корректный номер CTC. Повторите ввод',
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())

    def incorrect_input_mileage(self, message):
        self.bot.send_message(message.chat.id, 'Введите корректное значение пробега. Повторите ввод',
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())

    # def incorrect_input_vin(self, message):
    #     self.bot.send_message(message.chat.id, 'Введите корректный VIN (17 знаков). Повторите ввод',
    #                           parse_mode='HTML',
    #                           reply_markup=self.keyboards.menu_with_btn_back())

    def incorrect_input_fio(self, message):
        self.bot.send_message(message.chat.id, 'Введены некорректные данные. Повторите ввод',
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())

    def incorrect_input_username(self, message):
        self.bot.send_message(message.chat.id, 'Пользователь не найден. Повторите ввод',
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())

    def get_photos_report(self, message):
        alert, answer = api_request.request_photo(message.text)
        if not alert:
            urls = answer
            for url in urls:
                self.bot.send_photo(message.chat.id,
                                    photo=url,
                                    caption=f"Фото {urls.index(url) + 1} из {len(urls)}",
                                    reply_markup=self.keyboards.menu_with_btn_back())
        else:
            self.bot.send_message(message.chat.id, answer,
                                  parse_mode='HTML',
                                  reply_markup=self.keyboards.menu_with_btn_back())
        self.DB.reset_user_data(message)

    def get_gibdd_report(self, message):
        self.bot.send_message(message.chat.id, "Подождите минутку, готовим информацию",
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())
        alert, pre_pre_answer = False, api_request.request_gibdd_make(message.text)

        pre_answer = api_request.request_gibdd_get(pre_pre_answer)
 
        # while data.json()['data'][0]['progress_wait'] != 0:
        #     time.sleep(2)
        #     print('Накинули 2 секунды')
        #     data = requests.get(url_to_get,
        #                         headers={'Accept': 'application/json',
        #                                  'Authorization': 'AR-REST ' + spcr_token},
        #                         params=params_to_get)
        # return data.json()



        # alert, answer = False, fake_data  # заглушка
        if alert:
            msg_to_user = answer['gibdd'].get('message', 'Ошибка в работе сервисе, повторите попытку позже')
            self.bot.send_message(message.chat.id, msg_to_user,
                                  parse_mode='HTML',
                                  reply_markup=self.keyboards.menu_with_btn_back())
            self.DB.reset_user_data(message)
        if not alert:
            pprint(answer)
            self.DB.set_user_cache(message, answer)

            msg_to_user = car_report_message_spcr(answer)

            self.bot.send_message(message.chat.id, msg_to_user,
                                  parse_mode='HTML',
                                  reply_markup=self.keyboards.save_report_with_btn_back())
            self.DB.set_user_state(message, configuration.STATES['READY_TO_GET_PDF'])
            # self.DB.reset_user_data(message)
            # pdf = pdf_creator.CarReport(answer)

    def get_fines_report(self, message, regnum):
        alert, answer = api_request.request_fines(regnum, message.text)
        pprint(answer)
        if not alert:
            msg_to_user = fines_message(answer)
        else:
            msg_to_user = answer
        self.bot.send_message(message.chat.id, msg_to_user,
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())
        self.DB.reset_user_data(message)

    def get_price(self, message, cache, probeg):
        alert, answer = errors_handlers.car_price(api_request.request_price(cache, probeg))
        if not alert:
            msg_to_user = f"Ориентировочная рыночная стоимость составляет {answer['cost']} руб.\n " \
                          f"Если рассматривать Traid In, то {answer['cost_trade_in']} руб."
        else:
            msg_to_user = answer
        self.bot.send_message(message.chat.id, msg_to_user,
                              parse_mode='HTML',
                              reply_markup=self.keyboards.menu_with_btn_back())
        self.DB.reset_user_data(message)

    # работа с фото

    def handle(self):

        @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
            message) == configuration.STATES['DEFAULT'])
        def default_message(message):
            user = self.DB.choose_user(message)

            self.bot.send_message(message.chat.id, 'Выберите в главном меню доступное действие',
                                  parse_mode='HTML',
                                  reply_markup=self.keyboards.start_menu(user))

        @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
            message) == configuration.STATES['PHOTO_SET_REGNUMBER'])
        def entering_number_photo(message):
            if validators.reg_numder(message.text):
                self.get_photos_report(message)
                self.DB.reset_user_data(message)
            else:
                self.incorrect_input_regnumber(message)

        # работа с отчетом по vin или по grz

        @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
            message) in [configuration.STATES['CHOOSED_LIGHT'], configuration.STATES['CHOOSED_PRO']])
        def entering_vin_grz_gibdd(message):
            if validators.reg_numder(message.text) or validators.vin(message.text):
                self.get_gibdd_report(message)
            else:
                self.incorrect_input_for_report(message)


        # @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
        #     message) == configuration.STATES['GIBDD_SET_VIN'])
        # def entering_vin_gibdd(message):
        #     if validators.vin(message.text):
        #         self.get_gibdd_report(message)
        #         # self.DB.reset_user_data(message)
        #     else:
        #         self.incorrect_input_vin(message)

        # работа со штрафами

        @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
            message) == configuration.STATES['FINES_SET_REGNUMBER'])
        def entering_regnum_fines(message):
            if validators.reg_numder(message.text):
                self.DB.set_user_state(message, configuration.STATES['FINES_SET_STSNUMBER'])
                self.DB.set_user_cache(message, {'regnum': message.text})
                self.bot.send_message(message.chat.id, 'Теперь введите номер свидетельства ТС',
                                      parse_mode='HTML',
                                      reply_markup=self.keyboards.menu_with_btn_back())
            else:
                self.incorrect_input_regnumber(message)

        @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
            message) == configuration.STATES['FINES_SET_STSNUMBER'])
        def entering_sts_fines(message):
            if validators.sts_number(message.text):
                current_user = self.DB.choose_user(message)
                self.get_fines_report(message, current_user.cache['regnum'])
                self.DB.reset_user_data(message)
            else:
                self.incorrect_input_stsnumber(message)

        # работа с оценкой

        @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
            message) == configuration.STATES['PRICE_SET_PROBEG'])
        def entering_probeg_checkprice(message):
            if validators.mileage(message.text):
                current_user = self.DB.choose_user(message)
                self.get_price(message, current_user.cache, message.text)
                self.DB.reset_user_data(message)
            else:
                self.incorrect_input_mileage(message)

        # работа с фссп

        @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
            message) == configuration.STATES['FSSP_FIO'])
        def entering_fio_fssp(message):
            alert, answer = errors_handlers.regions(api_request.request_regions())
            if not alert:
                if validators.fio(message.text):
                    self.DB.set_user_state(message, configuration.STATES['FSSP_REGION_NAME'])
                    user_data = message.text.split()
                    if len(user_data) == 3:
                        self.DB.set_user_cache(message,
                                               {
                                                   'lastname': message.text.split()[0],
                                                   'firstname': message.text.split()[1],
                                                   'secondname': message.text.split()[2]
                                               })
                    elif len(user_data) == 2:
                        self.DB.set_user_cache(message,
                                               {
                                                   'lastname': message.text.split()[0],
                                                   'firstname': message.text.split()[1],
                                                   'secondname': None
                                               })
                    self.bot.send_message(message.chat.id, 'Выберите регион поиска',
                                          parse_mode='HTML',
                                          reply_markup=self.keyboards.keybord_inline(list(answer)))
                else:
                    self.incorrect_input_fio(message)
            else:
                self.bot.send_message(message.chat.id, answer,
                                      parse_mode='HTML',
                                      reply_markup=self.keyboards.menu_with_btn_back())

        # добавка подписки пользователю

        @self.bot.message_handler(func=lambda message: self.DB.get_user_state(
            message) == configuration.STATES['ADD_SUBSCRIBE'])
        def entering_username(message):
            current_user = self.DB.choose_user_for_add_subscribe(message.text)
            if current_user:
                self.DB.set_user_cache(message,
                                       {
                                           'subscribe_for_user': message.text
                                       })
                self.DB.set_user_state(message, configuration.STATES['QT_SUBSCRIBES'])
                self.bot.send_message(message.chat.id, 'Сколько запросов добавить?',
                                      parse_mode='HTML',
                                      reply_markup=self.keyboards.keybord_inline([x for x in range(1, 9)]))

            else:
                self.incorrect_input_username(message)
