fake_data = {'data': [{'active_from': '1900-01-01T00:00:00.000Z',
           'active_to': '3000-01-01T00:00:00.000Z',
           'comment': '',
           'content': {'accidents': {'has_accidents': False,
                                     'history': {'count': 0, 'items': []}},
                       'additional_info': {'vehicle': {'category': {'code': 'B'},
                                                       'exported': False,
                                                       'modifications': {'was_modificated': False},
                                                       'passport': {'date': {'receive': '2014-05-16 '
                                                                                        '00:00:00'},
                                                                    'has_dublicate': False,
                                                                    'number': '77УО070949'},
                                                       'sts': {'date': {'receive': '2022-04-29 '
                                                                                   '00:00:00'}}}},
                       'ads': {'history': {'count': 0, 'items': []}},
                       'commercial_use': {'items': []},
                       'fines': {'count': 6,
                                 'has_fines': True,
                                 'items': [{'_id': 142960845,
                                            'amount': {'total': 3000},
                                            'date': {'event': '2022-06-24 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '0321695310122062400016034 '
                                                           'от 2022-06-24 на '
                                                           '3,000.00 руб.',
                                            'discount': {'date': {'end': '2022-07-14 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'Г. СПБ, ПР. '
                                                                'ЛИГОВСКИЙ, У '
                                                                'Д.16А, ОТ '
                                                                'КУЗНЕЧНОГО '
                                                                'ПЕР. К ПЛ. '
                                                                'ВОССТАНИЯ, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '0321695310122062400016034',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(Комитет по '
                                                               'транспорту)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'Северо-Западное '
                                                                      'ГУ '
                                                                      'Банка '
                                                                      'России '
                                                                      '//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '82811601122010000140',
                                                     'okato': '40911000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '0321695310122062400016034 '
                                                                            'от '
                                                                            '24.06.2022'},
                                                     'user': {'kpp': '784201001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(Комитет '
                                                                      'по '
                                                                      'транспорту)',
                                                              'tin': '7830001067'}}},
                                           {'_id': 301624611,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-06-16 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810510220616074211 '
                                                           'от 2022-06-16 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-07-06 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': '289 КМ., 960 '
                                                                'М., '
                                                                'АВТОДОРОГА '
                                                                'А-121 '
                                                                "'СОРТАВАЛА', "
                                                                'КАРЕЛИЯ '
                                                                'РЕСП.'},
                                            'need_payment': False,
                                            'uin': '18810510220616074211',
                                            'vendor': {'name': 'УФК ПО '
                                                               'РЕСПУБЛИКЕ '
                                                               'КАРЕЛИЯ (МВД '
                                                               'по Республике '
                                                               'Карелия)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000010600'},
                                                              'bik': '018602104',
                                                              'name': 'ОТДЕЛЕНИЕ-НБ '
                                                                      'РЕСПУБЛИКА '
                                                                      'КАРЕЛИЯ '
                                                                      'БАНКА '
                                                                      'РОССИИ'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '86701000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810510220616074211 '
                                                                            'от '
                                                                            '16.06.2022'},
                                                     'user': {'kpp': '100101001',
                                                              'name': 'УФК ПО '
                                                                      'РЕСПУБЛИКЕ '
                                                                      'КАРЕЛИЯ '
                                                                      '(МВД по '
                                                                      'Республике '
                                                                      'Карелия)',
                                                              'tin': '1001041280'}}},
                                           {'_id': 2840402855,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-06-03 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810578220603273039 '
                                                           'от 2022-06-03 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-06-23 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'СЛАВЫ ПРОСП., '
                                                                'д.43/49, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '18810578220603273039',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(УГИБДД ГУ МВД '
                                                               'России по г. '
                                                               'Санкт-Петербургу '
                                                               'и '
                                                               'Ленинградской '
                                                               'области)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'СЕВЕРО-ЗАПАДНОЕ '
                                                                      'ГУ '
                                                                      'БАНКА '
                                                                      'РОССИИ//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '40394000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810578220603273039 '
                                                                            'от '
                                                                            '03.06.2022'},
                                                     'user': {'kpp': '781345001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(УГИБДД '
                                                                      'ГУ МВД '
                                                                      'России '
                                                                      'по г. '
                                                                      'Санкт-Петербургу '
                                                                      'и '
                                                                      'Ленинградской '
                                                                      'области)',
                                                              'tin': '7830002600'}}},
                                           {'_id': 1924936835,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-06-03 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810578220603152861 '
                                                           'от 2022-06-03 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-06-23 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'ЛЕНИНСКИЙ '
                                                                'ПРОСП., '
                                                                'д.147-А, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '18810578220603152861',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(УГИБДД ГУ МВД '
                                                               'России по г. '
                                                               'Санкт-Петербургу '
                                                               'и '
                                                               'Ленинградской '
                                                               'области)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'СЕВЕРО-ЗАПАДНОЕ '
                                                                      'ГУ '
                                                                      'БАНКА '
                                                                      'РОССИИ//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '40394000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810578220603152861 '
                                                                            'от '
                                                                            '03.06.2022'},
                                                     'user': {'kpp': '781345001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(УГИБДД '
                                                                      'ГУ МВД '
                                                                      'России '
                                                                      'по г. '
                                                                      'Санкт-Петербургу '
                                                                      'и '
                                                                      'Ленинградской '
                                                                      'области)',
                                                              'tin': '7830002600'}}},
                                           {'_id': 2868016983,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-06-02 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810578220602401300 '
                                                           'от 2022-06-02 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-06-22 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'СЛАВЫ ПРОСП., '
                                                                'д.43/49, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '18810578220602401300',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(УГИБДД ГУ МВД '
                                                               'России по г. '
                                                               'Санкт-Петербургу '
                                                               'и '
                                                               'Ленинградской '
                                                               'области)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'СЕВЕРО-ЗАПАДНОЕ '
                                                                      'ГУ '
                                                                      'БАНКА '
                                                                      'РОССИИ//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '40394000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810578220602401300 '
                                                                            'от '
                                                                            '02.06.2022'},
                                                     'user': {'kpp': '781345001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(УГИБДД '
                                                                      'ГУ МВД '
                                                                      'России '
                                                                      'по г. '
                                                                      'Санкт-Петербургу '
                                                                      'и '
                                                                      'Ленинградской '
                                                                      'области)',
                                                              'tin': '7830002600'}}},
                                           {'_id': 825679884,
                                            'amount': {'total': 500},
                                            'date': {'event': '2022-05-30 '
                                                              '00:00:00'},
                                            'description': 'УИН '
                                                           '18810578220530428054 '
                                                           'от 2022-05-30 на '
                                                           '500.00 руб.',
                                            'discount': {'date': {'end': '2022-06-19 '
                                                                         '00:00:00'},
                                                         'percent': 50},
                                            'is_paid': True,
                                            'location': {'raw': 'СЛАВЫ ПРОСП., '
                                                                'д.43/49, '
                                                                'САНКТ-ПЕТЕРБУРГ '
                                                                'Г.'},
                                            'need_payment': False,
                                            'uin': '18810578220530428054',
                                            'vendor': {'name': 'УФК по г. '
                                                               'Санкт-Петербургу '
                                                               '(УГИБДД ГУ МВД '
                                                               'России по г. '
                                                               'Санкт-Петербургу '
                                                               'и '
                                                               'Ленинградской '
                                                               'области)'},
                                            'wire': {'bank': {'account': {'number': '03100643000000017200'},
                                                              'bik': '014030106',
                                                              'name': 'СЕВЕРО-ЗАПАДНОЕ '
                                                                      'ГУ '
                                                                      'БАНКА '
                                                                      'РОССИИ//УФК '
                                                                      'по г. '
                                                                      'Санкт-Петербургу'},
                                                     'kbk': '18811601121010001140',
                                                     'okato': '40394000',
                                                     'payment': {'purpose': 'Оплата '
                                                                            'штрафа '
                                                                            'по '
                                                                            'постановлению '
                                                                            '18810578220530428054 '
                                                                            'от '
                                                                            '30.05.2022'},
                                                     'user': {'kpp': '781345001',
                                                              'name': 'УФК по '
                                                                      'г. '
                                                                      'Санкт-Петербургу '
                                                                      '(УГИБДД '
                                                                      'ГУ МВД '
                                                                      'России '
                                                                      'по г. '
                                                                      'Санкт-Петербургу '
                                                                      'и '
                                                                      'Ленинградской '
                                                                      'области)',
                                                              'tin': '7830002600'}}}]},
                       'identifiers': {'vehicle': {'pts': '77УО070949',
                                                   'reg_num': 'О956КВ716',
                                                   'sts': '9942879293',
                                                   'vin': 'WDD1760521J279894'}},
                       'identifiers_masked': {'vehicle': {'pts': '77У*****49',
                                                          'reg_num': 'О9*****16',
                                                          'sts': '994*****93',
                                                          'vin': 'WDD1************4'}},
                       'images': {'photos': {'count': 5,
                                             'items': [{'_id': 2251974969,
                                                        'date': {'issued': '2022-08-26 '
                                                                           '00:00:00'},
                                                        'uri': 'https://ng-images.avtocod.ru/images/2022/09/18/38cfb48cdbc9b802a0a7a67515becd7c.jpg'},
                                                       {'_id': 746517553,
                                                        'date': {'issued': '2022-08-25 '
                                                                           '21:51:08'},
                                                        'uri': 'https://img03.platesmania.com/220825/o/19795067.jpg',
                                                        'vehicle': {'brand': {'name': 'Mercedes-Benz'},
                                                                    'model': {'name': 'A-Klasse'}}},
                                                       {'_id': 1577076771,
                                                        'date': {'issued': '2022-06-23 '
                                                                           '00:00:00'},
                                                        'uri': 'https://ng-images.avtocod.ru/images/2022/09/18/8872cb86ddba51872352fa33e625231d.jpg'},
                                                       {'_id': 3114868144,
                                                        'date': {'issued': '2022-06-23 '
                                                                           '00:00:00'},
                                                        'uri': 'https://ng-images.avtocod.ru/images/2022/09/18/c05696b0ade0d50a02e7f885b484743d.jpg'},
                                                       {'_id': 3485710330,
                                                        'date': {'issued': '2022-06-23 '
                                                                           '00:00:00'},
                                                        'uri': 'https://ng-images.avtocod.ru/images/2022/09/18/77e7b3a3b5f0a7701ed2a20d441c99ba.jpg'}]}},
                       'insurance': {'osago': {'count': 1,
                                               'items': [{'_id': 131371244,
                                                          'contract': {'amount': {'currency': 'RUB',
                                                                                  'value': 13255.85},
                                                                       'has_trailer': False,
                                                                       'is_active': True,
                                                                       'is_follow_to_registration': False,
                                                                       'kbm': 0.83,
                                                                       'using_type': {'description': 'Личная',
                                                                                      'status': 'PERSONAL'}},
                                                          'date': {'created': '2022-04-28 '
                                                                              '00:00:00',
                                                                   'end': '2023-04-28 '
                                                                          '00:00:00',
                                                                   'periods': [{'end': '2023-04-28',
                                                                                'start': '2022-04-29'}],
                                                                   'start': '2022-04-29 '
                                                                            '00:00:00'},
                                                          'geo': {'region': 'Татарстан '
                                                                            'Респ'},
                                                          'insurant': {'dob': '1993-07-01',
                                                                       'name': 'Х***** '
                                                                               'ШАМИЛЬ '
                                                                               'НИЯЗОВИЧ',
                                                                       'type': 'PERSON'},
                                                          'insurer': {'name': 'АО '
                                                                              '"ГСК '
                                                                              '"Югория"'},
                                                          'number': 'ХХХ '
                                                                    '0237468752',
                                                          'owner': {'dob': '1993-07-01',
                                                                    'name': 'Х***** '
                                                                            'ШАМИЛЬ '
                                                                            'НИЯЗОВИЧ',
                                                                    'type': 'PERSON'},
                                                          'policy': {'expired': False,
                                                                     'is_active': True,
                                                                     'number': '0237468752',
                                                                     'series': 'ХХХ',
                                                                     'status': 'Действует'},
                                                          'restrictions': {'drivers': 1,
                                                                           'type': 'WITH '
                                                                                   'RESTRICTIONS'},
                                                          'vehicle': {'engine': {'power': {'hp': 360}},
                                                                      'identifiers': {'vin': 'WDD1760521J279894'},
                                                                      'model': {'name': 'MERCEDES-BENZ '
                                                                                        'A45 '
                                                                                        'AMG, '
                                                                                        'MERCEDES-BENZ '
                                                                                        'A45 '
                                                                                        'AMG '
                                                                                        '(категория '
                                                                                        '«B»)'}}}]}},
                       'leasings': {'count': 0,
                                    'items': [],
                                    'used_in_leasing': False},
                       'mileages': {'count': 5,
                                    'items': [{'_id': 1354850421,
                                               'actuality': {'date': '2022-09-13 '
                                                                     '19:04:35'},
                                               'date': {'event': '2016-11-10 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'repairs.history'},
                                               'mileage': 26571},
                                              {'_id': 1919635491,
                                               'actuality': {'date': '2022-09-15 '
                                                                     '17:56:09'},
                                               'date': {'event': '2017-06-15 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'gibdd.eaisto'},
                                               'mileage': 34100},
                                              {'_id': 2886830751,
                                               'actuality': {'date': '2022-09-15 '
                                                                     '17:56:09'},
                                               'date': {'event': '2019-06-17 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'gibdd.eaisto'},
                                               'mileage': 44950},
                                              {'_id': 927710437,
                                               'actuality': {'date': '2022-09-18 '
                                                                     '12:04:22'},
                                               'date': {'event': '2021-07-21 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'service.history'},
                                               'mileage': 91846},
                                              {'_id': 4285171619,
                                               'actuality': {'date': '2022-09-15 '
                                                                     '17:56:09'},
                                               'date': {'event': '2022-04-29 '
                                                                 '00:00:00'},
                                               'filled_by': {'source': 'gibdd.eaisto'},
                                               'mileage': 96106}]},
                       'ownership': {'history': {'count': 2,
                                                 'items': [{'_id': 2204300142,
                                                            'date': {'start': '2022-04-29 '
                                                                              '00:00:00'},
                                                            'last_operation': {'code': '03',
                                                                               'description': 'Изменение '
                                                                                              'собственника '
                                                                                              '(владельца) '
                                                                                              'в '
                                                                                              'результате '
                                                                                              'совершения '
                                                                                              'сделки, '
                                                                                              'вступления '
                                                                                              'в '
                                                                                              'наследство, '
                                                                                              'слияние '
                                                                                              'и '
                                                                                              'разделение '
                                                                                              'капитала '
                                                                                              'у '
                                                                                              'юридического '
                                                                                              'лица, '
                                                                                              'переход '
                                                                                              'права '
                                                                                              'по '
                                                                                              'договору '
                                                                                              'лизинга, '
                                                                                              'судебные '
                                                                                              'решения '
                                                                                              'и '
                                                                                              'др.'},
                                                            'owner': {'type': 'PERSON'}},
                                                           {'_id': 514048436,
                                                            'date': {'end': '2022-04-29 '
                                                                            '00:00:00',
                                                                     'start': '2014-06-20 '
                                                                              '00:00:00'},
                                                            'last_operation': {'code': '01',
                                                                               'description': 'Регистрация '
                                                                                              'новых, '
                                                                                              'произведенных '
                                                                                              'в '
                                                                                              'России '
                                                                                              'или '
                                                                                              'везенных, '
                                                                                              'а '
                                                                                              'также '
                                                                                              'ввезенных '
                                                                                              'в '
                                                                                              'Россию '
                                                                                              'бывших '
                                                                                              'в '
                                                                                              'эксплуатации, '
                                                                                              'в '
                                                                                              'том '
                                                                                              'числе '
                                                                                              'временно '
                                                                                              'на '
                                                                                              'срок '
                                                                                              'более '
                                                                                              '6 '
                                                                                              'месяцев, '
                                                                                              'испытательной '
                                                                                              'техники'},
                                                            'owner': {'type': 'PERSON'}}]}},
                       'pledges': {'count': 0,
                                   'date': {'update': '2022-09-18 00:00:00'},
                                   'items': []},
                       'registration_actions': {'count': 2,
                                                'items': [{'_id': 3386762975,
                                                           'code': '94',
                                                           'date': {'start': '2022-04-29 '
                                                                             '00:00:00'},
                                                           'identifiers': {'pts': '77УО070949'},
                                                           'owner': {'type': 'PERSON'},
                                                           'type': 'Изменение '
                                                                   'собственника '
                                                                   'по '
                                                                   'сделкам, '
                                                                   'произведенным '
                                                                   'в любой '
                                                                   'форме с '
                                                                   'сохранением '
                                                                   'государственных '
                                                                   'регистрационных '
                                                                   'знаков'},
                                                          {'_id': 2929618715,
                                                           'code': '11',
                                                           'date': {'end': '2022-04-29 '
                                                                           '00:00:00',
                                                                    'start': '2014-06-20 '
                                                                             '00:00:00'},
                                                           'geo': {'city': 'г '
                                                                           'Москва',
                                                                   'house': '20',
                                                                   'region': 'г '
                                                                             'Москва',
                                                                   'street': 'ул '
                                                                             'Лобненская'},
                                                           'identifiers': {'pts': '77УО070949'},
                                                           'owner': {'type': 'PERSON'},
                                                           'type': 'Первичная '
                                                                   'регистрация'}]},
                       'report_meta': {},
                       'restrictions': {'registration_actions': {'count': 0,
                                                                 'has_restrictions': False,
                                                                 'items': []}},
                       'stealings': {'count': 0,
                                     'is_wanted': False,
                                     'items': []},
                       'taxi': {'history': {'count': 0, 'items': []},
                                'used_in_taxi': False},
                       'tech_data': {'body': {'color': {'name': 'Синий Яркий',
                                                        'type': 'Синий'}},
                                     'brand': {'id': 'ID_MARK_MERCEDES_BENZ',
                                               'logotype': {'uri': 'https://vl.imgix.net/img/mercedes-benz-logo.png'},
                                               'name': {'normalized': 'Mercedes-Benz',
                                                        'original': 'Mercedes '
                                                                    'Benz Без '
                                                                    'Модели '
                                                                    'А45 Амg '
                                                                    '4Матiс'}},
                                     'drive': {'type': 'Полноприводной',
                                               'type_id': 'ID_DRIVING_WHEELS_TYPE_ALL'},
                                     'engine': {'fuel': {'type': 'Бензиновый',
                                                         'type_id': 'ID_ENGINE_TYPE_PETROL'},
                                                'model': {'name': '133980'},
                                                'number': '80012778',
                                                'power': {'hp': 360, 'kw': 265},
                                                'volume': 1991},
                                     'model': {'id': 'ID_MARK_MERCEDES_BENZ_MODEL_A_KLASS_AMG',
                                               'name': {'normalized': 'A-Класс '
                                                                      'AMG'}},
                                     'type': {'code': '29',
                                              'name': 'Легковые автомобили '
                                                      'прочие'},
                                     'weight': {'max': 2050, 'netto': 1555},
                                     'wheel': {'position': 'LEFT',
                                               'position_code': '1',
                                               'position_id': 'ID_STEERING_WHEEL_TYPE_LEFT'},
                                     'year': 2014},
                       'utilizations': {'count': 0,
                                        'items': [],
                                        'was_utilized': False}},
           'created_at': '2022-09-18T12:04:21.752Z',
           'created_by': 'system',
           'domain_uid': 'iqworks',
           'last_generation_stat': {'complete_time': '2022-09-18T12:05:23.776Z',
                                    'duration': 61980,
                                    'start_time': '2022-09-18T12:04:21.796Z'},
           'name': 'NONAME',
           'progress_error': 0,
           'progress_ok': 20,
           'progress_wait': 0,
           'query': {'body': 'WDD1760521J279894',
                     'schema_version': '1.0',
                     'storages': {},
                     'type': 'VIN'},
           'report_type_uid': 'report_check_vehicle@iqworks',
           'requested_at': '2022-09-18T12:04:21.796Z',
           'state': {'sources': [{'_id': 'carsharing.registry',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'service.history.fitservice',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'pledge',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.dtp',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.restrict',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.wanted',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'fines.base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'av.taxi',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'service.history.filter',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.history',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'service.history',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'mileages.registry',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'ads.base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'references.base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'service.history.wilgood',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'images.avtonomer',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'gibdd.eaisto',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'rsaosago.base',
                                  'extended_state': 'OK',
                                  'state': 'OK'},
                                 {'_id': 'images.archive',
                                  'extended_state': 'OK',
                                  'state': 'OK'}]},
           'tags': '',
           'uid': 'report_check_vehicle_WDD1760521J279894@iqworks',
           'updated_at': '2022-09-18T12:05:24.799Z',
           'updated_by': 'system',
           'vehicle_id': 'WDD1760521J279894'}],
 'size': 1,
 'stamp': '2022-09-18T12:06:06.827Z',
 'state': 'ok',
 'version': '2.0'}